{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PUFPaY9KxDAcGqfsorJp3Q", "review_id": "Ya85v4eqdd6k9Od8HbQjyA", "stars": 4, "date": "2012-08-01", "text": "Mr Hoagie is an institution. Walking in, it does seem like a throwback to 30 years ago, old fashioned menu board, booths out of the 70s, and a large selection of food. Their speciality is the Italian Hoagie, and it is voted the best in the area year after year. I usually order the burger, while the patties are obviously cooked from frozen, all of the other ingredients are very fresh. Overall, its a good alternative to Subway, which is down the road.", "type": "review", "business_id": "5UmKMjUEUNdYWqANhGckJw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Iu6AxdBYGR4A0wspR9BYHA", "review_id": "KPvLNJ21_4wbYNctrOwWdQ", "stars": 5, "date": "2014-02-13", "text": "Excellent food. Superb customer service. I miss the mario machines they used to have, but it's still a great place steeped in tradition.", "type": "review", "business_id": "5UmKMjUEUNdYWqANhGckJw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "auESFwWvW42h6alXgFxAXQ", "review_id": "fFSoGV46Yxuwbr3fHNuZig", "stars": 5, "date": "2015-10-31", "text": "Yes this place is a little out dated and not opened on the weekend. But other than that the staff is always pleasant and fast to make your order. Which is always spot on fresh veggies on their hoggies and other food. They also have daily specials and ice cream which is really good. I had a banana split they piled the toppings on. They win pennysaver awards ever years i see why.", "type": "review", "business_id": "5UmKMjUEUNdYWqANhGckJw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uK8tzraOp4M5u3uYrqIBXg", "review_id": "Di3exaUCFNw1V4kSNW5pgA", "stars": 5, "date": "2013-11-08", "text": "All the food is great here. But the best thing they have is their wings. Their wings are simply fantastic!!  The \"Wet Cajun\" are by the best & most popular.  I also like the seasoned salt wings.  Wing Night is Monday & Wednesday night, $0.75 whole wings!\n\nThe dining area is nice. Very family friendly! The bar is very nice is well.  This place is truly a Yinzer's dream!!  \"Pittsburgh Dad\" would love this place n'at!!", "type": "review", "business_id": "UsFtqoBl7naz8AVUBZMjQQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "I_47G-R2_egp7ME5u_ltew", "review_id": "0Lua2-PbqEQMjD9r89-asw", "stars": 3, "date": "2014-03-29", "text": "We checked this place out this past Monday for their wing night. We have heard that their wings are great and decided it was finally time to check it out. Their wings are whole wings and crispy, which is a nice change of pace. I got their wet Cajun sauce and garlic butter wings. The Cajun did not have a bold enough flavor for me and their sauce is too thin. The sauce was also thin for the garlic butter, but that is more expected. They were better than average, but I don't like seeing all the sauce resting at the bottom of the boat. I would definitely come try this place out again to sample some of the other items on the menu, but this will probably not become a regular stop for wings anytime soon.", "type": "review", "business_id": "UsFtqoBl7naz8AVUBZMjQQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PP_xoMSYlGr2pb67BbqBdA", "review_id": "7N9j5YbBHBW6qguE5DAeyA", "stars": 1, "date": "2014-10-29", "text": "Wing sauce is like water. Pretty much a lot of butter and some hot sauce (franks red hot maybe).  The whole wings are good size and crispy, but for $1 a wing the sauce could be better. The hot and extra hot are about the same flavor/heat.  The fish sandwich is good and is a large portion, sides are decent.", "type": "review", "business_id": "UsFtqoBl7naz8AVUBZMjQQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JPPhyFE-UE453zA6K0TVgw", "review_id": "mjCJR33jvUNt41iJCxDU_g", "stars": 4, "date": "2014-11-28", "text": "Cold cheap beer. Good bar food. Good service. \n\nLooking for a great Pittsburgh style fish sandwich, this is the place to go. The breading is light, fish is more than plentiful and a good side of home cut fries. \n\nGood grilled chicken salads or steak.  Soup of day is homemade and lots of specials. Great place for lunch or bar snacks and beer.", "type": "review", "business_id": "UsFtqoBl7naz8AVUBZMjQQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2d5HeDvZTDUNVog_WuUpSg", "review_id": "Ieh3kfZ-5J9pLju4JiQDvQ", "stars": 5, "date": "2014-02-27", "text": "I highly recommend this place. The mechanics are really honest and I'm usually in and out with no issues.", "type": "review", "business_id": "3eu6MEFlq2Dg7bQh8QbdOg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "BShxMIUwaJS378xcrz4Nmg", "review_id": "PU28OoBSHpZLkYGCmNxlmg", "stars": 5, "date": "2015-06-16", "text": "I am a big believer in first impressions, so when I go to a new business I pay close attention to how they treat me and how they run their business. Joe was very polite and friendly as soon as I met him, as was his shop assistant. I needed a CV joint installed as well as a new transmission mount. Joe was nice enough to estimate a fair price to install both, he honored that price, was fast, very friendly, and treated me like he knew me for years. It's a great neighborhood shop and Joe is a real nice guy who could have easily raked me over the coals, but he didn't. I know quite a bit about cars, and everything he told me was true. He's earned my repeat business immediately. Give him a call, you'll be glad you did. Thanks Joe!", "type": "review", "business_id": "3eu6MEFlq2Dg7bQh8QbdOg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "fhNxoMwwTipzjO8A9LFe8Q", "review_id": "XsA6AojkWjOHA4FmuAb8XQ", "stars": 3, "date": "2012-08-19", "text": "Decent range somewhat close to the city.  The mats are pretty solid; however, the grass range needs to be tended too.  It's like hitting out of US Open type rough...not very amenable to practicing.  Which kind of defeats the purpose of going to a golf range...Still gets 3 stars because the range is lit up at night which is excellent for those of us who are addicted to this amazing game, but are somewhat short on time (having a job kinda sucks sometimes, no?).", "type": "review", "business_id": "cE27W9VPgO88Qxe4ol6y_g"}
